ГТС/УТГТС/DataProcessors/ОперацииЗакрытияМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОперацииЗакрытияМесяца</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МассивОрганизаций</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрацииРегламентный</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрацииРегламентныйМУ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстанавливатьсяПоОшибке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьЭтапыСоСтатусомНеТребуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьЭтапыСоСтатусомВыполненоУспешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьПоясненияКЭтапам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтообновлениеПриЗакрытииПодчиненныхФорм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗакрытияМесяца</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыЗакрытияМесяца</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПредварительногоЗакрытияМесяца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/ПроблемыСостоянияСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПроблемыСостоянияСистемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВажностьПроблемыУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отложена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПроверкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроверяемыйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проблема</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/DataProcessors/ОперацииЗакрытияМесяца/Forms/РезультатыПроверки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = НСтр("ru='Результаты проверки состояния учета'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ПараметрыПроверок = Параметры.ПараметрыПроверок;
	
	МассивОрганизаций = Новый Массив;
	ПроверяемыйПериод = Дата(1,1,1);
	Проверка = Неопределено;
	КонтекстПроверокВеденияУчета = Неопределено;
	ТекстПроблемы = "";
	
	Если ТипЗнч(ПараметрыПроверок) = Тип("Структура") Тогда

		Если ЗначениеЗаполнено(ПараметрыПроверок.МассивОрганизаций) Тогда
			МассивОрганизаций = ПараметрыПроверок.МассивОрганизаций;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрыПроверок.ПроверяемыйПериод) Тогда
			ПроверяемыйПериод = ПараметрыПроверок.ПроверяемыйПериод;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрыПроверок.Проверка) Тогда
			Проверка = ПараметрыПроверок.Проверка;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрыПроверок.КонтекстПроверокВеденияУчета) Тогда
			КонтекстПроверокВеденияУчета = ПараметрыПроверок.КонтекстПроверокВеденияУчета;
		КонецЕсли;
		
		ТекстПроблемы = Параметры.ТекстПроблемы;
		ПозицияУточнения = СтрНайти(ТекстПроблемы, "(", НаправлениеПоиска.СКонца);
		
		Если ПозицияУточнения > 0 Тогда
			ТекстПроблемы = СокрЛП(Лев(ТекстПроблемы, ПозицияУточнения - 1)); 
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список,
		"ТекстПодробнее",
		ЗакрытиеМесяцаСервер.ТекстПодробнееПоУмолчанию());
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список,
		"МассивОрганизаций",
		МассивОрганизаций);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список,
		"ПроверяемыйПериод",
		ПроверяемыйПериод);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список,
		"Проверка",
		Проверка);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список,
		"КонтекстПроверокВеденияУчета",
		КонтекстПроверокВеденияУчета);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список,
		"ТекстПроблемы",
		ТекстПроблемы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия <> "ОбновлениеРезультатовПроверокВФормеЗакрытияМесяца" Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		ОписаниеПроверки = "";
	Иначе
		ОписаниеПроверки = СокрЛП(Элементы.Список.ТекущиеДанные.ОписаниеПроверки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.Подробнее И НЕ ТекущиеДанные.ЭтоСоставнойОбъект И ЗначениеЗаполнено(ТекущиеДанные.Объект) Тогда
		ОтображаемоеЗначение = ТекущиеДанные.Объект;
	ИначеЕсли НЕ ТекущиеДанные.ЕстьЗаписьРегистраОбъектов Тогда
		ОтображаемоеЗначение = СформироватьКлючЗаписиРегистраПроблемСостоянияСистемы(ТекущиеДанные);
	Иначе
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьЗначение(, ОтображаемоеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьКлючЗаписиРегистраПроблемСостоянияСистемы(ТекущиеДанные)
	
	//@skip-check structure-consructor-too-many-keys
	Отбор = Новый Структура("Проверка, Организация, ПроверяемыйПериод, Проблема");
	ЗаполнитьЗначенияСвойств(Отбор, ТекущиеДанные);
	
	КлючЗаписи = РегистрыСведений.ПроблемыСостоянияСистемы.СоздатьКлючЗаписи(Отбор);
	
	Возврат КлючЗаписи;
	
КонецФункции
	
#КонецОбласти
